package javafromepam.classesandmethods;

public class ChapterNotes {

    public static void main(String[] args) {

        // Базовые (примитивные) типы данных, значения которых (литералы) находятся в стековой памяти. Так сделано для повышения производительности.
        // У каждого примитивного типа данных есть класс - оболочка, инкапсулирующий данные базовых типов в объекты, которые находятся в динамической памяти (heap).

        // Базовые типы обеспечивают более высокую производительность вычислений по сравнению с объектами классов - оболочек
        // 8 базовых типов: byte (8 bit), short (16 bit), int (32 bit), long (64 bit), float (32 bit), double (32 bit), boolean, char (16 bit).

    }
}
